participation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-07 Mon 15:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PL Reading Group @ IU</title>
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Fira+Mono&family=Libre+Baskerville&display=swap" rel="stylesheet">
<link rel="stylesheet" href="white_clean.css">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<nav>
<b>#</b>
<a href="./index.html">        <u>Home         </u></a> |
<a href="./participation.html"><u>Participating</u></a> |
<a href="./contact.html">      <u>Contact      </u></a> |
<a href="./archive.html">      <u>Past Events  </u></a>
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">PL Reading Group @ IU
<br />
<span class="subtitle">Participation</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org705d1cd">Everyone is Welcome!</a></li>
<li><a href="#org0f8b722"><font color="#a90533">Call for Presentations</font></a></li>
<li><a href="#org604c1f8">Paper Bidding Mechanism (RFC)</a></li>
<li><a href="#org3c703c7">Paper Discussion</a></li>
<li><a href="#org84767b8">COVID &amp; Health</a></li>
</ul>
</div>
</div>

<div id="outline-container-org705d1cd" class="outline-2">
<h2 id="org705d1cd">Everyone is Welcome!</h2>
</div>

<div id="outline-container-org0f8b722" class="outline-2">
<h2 id="org0f8b722"><font color="#a90533">Call for Presentations</font></h2>
<div class="outline-text-2" id="text-org0f8b722">
<p>
Please send us (<a href="./contact.html">contact</a>) a short proposal (informal; one paragraph) if you
have an idea, including but not limited to:
</p>

<ul class="org-ul">
<li>Presenting a classic work <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.</li>
<li>Talking about your original work (library, language design, etc. ).</li>
<li>Tutorial (for example, how to use a proof assistant).</li>
</ul>
</div>
</div>


<div id="outline-container-org604c1f8" class="outline-2">
<h2 id="org604c1f8">Paper Bidding Mechanism (RFC)</h2>
<div class="outline-text-2" id="text-org604c1f8">
<p>
We maintain <a href="https://docs.google.com/spreadsheets/d/1NuWy4YpqwUCiR2V9wU1nb7UOKCusfiz1jaHEHUaEg3Y/edit?usp=sharing">a queue of papers</a> where every member can contribute to. New
proposals are pushed to the rear of the queue.
</p>

<p>
Paper selection is bidding-based: we maintain a sliding window with a
tentative size of 3 (arbitrarily chosen), The window starts from the head
of the queue. Members select from these 3 papers and vote for the next
one to read. We then update the queue by popping the winner.
</p>
</div>
</div>

<div id="outline-container-org3c703c7" class="outline-2">
<h2 id="org3c703c7">Paper Discussion</h2>
<div class="outline-text-2" id="text-org3c703c7">
<ul class="org-ul">
<li>We expect that every participant read the paper before coming to the discussion
session. You do not need to understand every detail, but it is recommended that
you go through the paper and get the main idea.</li>
<li>We recommend that you bring a physical or electronic copy of the paper to the
discussion.</li>
</ul>
</div>
</div>

<div id="outline-container-org84767b8" class="outline-2">
<h2 id="org84767b8">COVID &amp; Health</h2>
<div class="outline-text-2" id="text-org84767b8">
<ul class="org-ul">
<li>Due to COVID-19, it <b>is required</b> to wear a mask when attending in-person meetings.</li>
<li>Food is unfortunately not provided per IU guideline "about food at events and meetings".</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Not limited to the ones in the paper queue.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2022-02-07 Mon 15:58</p>
</div>
</body>
</html>
